tests/perf/report_400/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1200,
    "errorCount" : 400,
    "errorPct" : 33.333332,
    "meanResTime" : 1.1691666666666654,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 8.970000000000027,
    "throughput" : 122.22448563862294,
    "receivedKBytesPerSec" : 77.78283509879813,
    "sentKBytesPerSec" : 22.71815797514769
  },
  "Create Booking" : {
    "transaction" : "Create Booking",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6825000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 6.0,
    "throughput" : 41.36076931030917,
    "receivedKBytesPerSec" : 15.55067986764554,
    "sentKBytesPerSec" : 12.80406628063282
  },
  "Search Properties" : {
    "transaction" : "Search Properties",
    "sampleCount" : 400,
    "errorCount" : 400,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 41.36076931030917,
    "receivedKBytesPerSec" : 45.31912418570986,
    "sentKBytesPerSec" : 0.0
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.824999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 79.0,
    "throughput" : 40.74564530915759,
    "receivedKBytesPerSec" : 17.826219822756443,
    "sentKBytesPerSec" : 10.106829988794948
  }
}