tests/perf/report_500/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1500,
    "errorCount" : 500,
    "errorPct" : 33.333332,
    "meanResTime" : 1.1746666666666674,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 6.0,
    "throughput" : 152.5940996948118,
    "receivedKBytesPerSec" : 97.10985185656155,
    "sentKBytesPerSec" : 28.363030900305187
  },
  "Create Booking" : {
    "transaction" : "Create Booking",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6140000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 4.0,
    "throughput" : 51.69027189083015,
    "receivedKBytesPerSec" : 19.434330740204693,
    "sentKBytesPerSec" : 16.001773622454255
  },
  "Search Properties" : {
    "transaction" : "Search Properties",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.0020000000000000018,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 51.68492867479843,
    "receivedKBytesPerSec" : 56.63133786437875,
    "sentKBytesPerSec" : 0.0
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.9079999999999986,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 91.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 88.0,
    "throughput" : 50.86987486010784,
    "receivedKBytesPerSec" : 22.25557025129718,
    "sentKBytesPerSec" : 12.618113490690812
  }
}