tests/perf/report_500/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6220000000000008,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 151.82186234817812,
    "receivedKBytesPerSec" : 65.38422001518218,
    "sentKBytesPerSec" : 35.830354883603235
  },
  "Create Booking" : {
    "transaction" : "Create Booking",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.25999999999999984,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.09862033725089,
    "receivedKBytesPerSec" : 19.21188362289218,
    "sentKBytesPerSec" : 15.818615866121615
  },
  "Search Properties" : {
    "transaction" : "Search Properties",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.282,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 51.09339873288371,
    "receivedKBytesPerSec" : 24.448989628040056,
    "sentKBytesPerSec" : 7.68396816881259
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3240000000000005,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 43.0,
    "throughput" : 50.61241016297196,
    "receivedKBytesPerSec" : 22.142929446300233,
    "sentKBytesPerSec" : 12.554250177143436
  }
}